## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_monitor_alert_prometheus_rule_group.recording-rules-k8s["blue"] will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "recording-rules-k8s" {
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "northeurope"
      + name                = "recording-rules-k8s"
      + resource_group_name = "prvaks-monitoring-rg"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + rule {
          + enabled    = true
          + expression = "sum by (cluster, namespace, pod, container) (irate(container_cpu_usage_seconds_total{job=\"cadvisor\", image!=\"\"}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=\"\"}))"
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = "container_memory_working_set_bytes{job=\"cadvisor\", image!=\"\"}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1, max by(namespace, pod, node) (kube_pod_info{node!=\"\"}))"
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = "container_memory_rss{job=\"cadvisor\", image!=\"\"}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1, max by(namespace, pod, node) (kube_pod_info{node!=\"\"}))"
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = "container_memory_cache{job=\"cadvisor\", image!=\"\"}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1, max by(namespace, pod, node) (kube_pod_info{node!=\"\"}))"
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = "container_memory_swap{job=\"cadvisor\", image!=\"\"}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1, max by(namespace, pod, node) (kube_pod_info{node!=\"\"}))"
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = "kube_pod_container_resource_requests{resource=\"memory\",job=\"kube-state-metrics\"} * on(namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ((kube_pod_status_phase{phase=~\"Pending|Running\"} == 1))"
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = "sum by (namespace, cluster) (sum by (namespace, pod, cluster) (max by (namespace, pod, container, cluster) (kube_pod_container_resource_requests{resource=\"memory\",job=\"kube-state-metrics\"}) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (kube_pod_status_phase{phase=~\"Pending|Running\"} == 1)))"
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = "kube_pod_container_resource_requests{resource=\"cpu\",job=\"kube-state-metrics\"} * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ((kube_pod_status_phase{phase=~\"Pending|Running\"} == 1))"
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = "sum by (namespace, cluster) (sum by(namespace, pod, cluster) (max by(namespace, pod, container, cluster) (kube_pod_container_resource_requests{resource=\"cpu\",job=\"kube-state-metrics\"}) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (kube_pod_status_phase{phase=~\"Pending|Running\"} == 1)))"
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = "kube_pod_container_resource_limits{resource=\"memory\",job=\"kube-state-metrics\"} * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ((kube_pod_status_phase{phase=~\"Pending|Running\"} == 1))"
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = "sum by (namespace, cluster) (sum by (namespace, pod, cluster) (max by (namespace, pod, container, cluster) (kube_pod_container_resource_limits{resource=\"memory\",job=\"kube-state-metrics\"}) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (kube_pod_status_phase{phase=~\"Pending|Running\"} == 1)))"
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = "kube_pod_container_resource_limits{resource=\"cpu\",job=\"kube-state-metrics\"} * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~\"Pending|Running\"} == 1) )"
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = "sum by (namespace, cluster) (sum by (namespace, pod, cluster) (max by(namespace, pod, container, cluster) (kube_pod_container_resource_limits{resource=\"cpu\",job=\"kube-state-metrics\"}) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (kube_pod_status_phase{phase=~\"Pending|Running\"} == 1)))"
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = "max by (cluster, namespace, workload, pod) (label_replace(label_replace(kube_pod_owner{job=\"kube-state-metrics\", owner_kind=\"ReplicaSet\"}, \"replicaset\", \"$1\", \"owner_name\", \"(.*)\") * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (1, max by (replicaset, namespace, owner_name) (kube_replicaset_owner{job=\"kube-state-metrics\"})), \"workload\", \"$1\", \"owner_name\", \"(.*)\"))"
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = "max by (cluster, namespace, workload, pod) (label_replace(kube_pod_owner{job=\"kube-state-metrics\", owner_kind=\"DaemonSet\"}, \"workload\", \"$1\", \"owner_name\", \"(.*)\"))"
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = "max by (cluster, namespace, workload, pod) (label_replace(kube_pod_owner{job=\"kube-state-metrics\", owner_kind=\"StatefulSet\"}, \"workload\", \"$1\", \"owner_name\", \"(.*)\"))"
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = "max by (cluster, namespace, workload, pod) (label_replace(kube_pod_owner{job=\"kube-state-metrics\", owner_kind=\"Job\"}, \"workload\", \"$1\", \"owner_name\", \"(.*)\"))"
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = "sum(node_memory_MemAvailable_bytes{job=\"node\"} or (node_memory_Buffers_bytes{job=\"node\"} + node_memory_Cached_bytes{job=\"node\"} + node_memory_MemFree_bytes{job=\"node\"} + node_memory_Slab_bytes{job=\"node\"})) by (cluster)"
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = "sum(rate(node_cpu_seconds_total{job=\"node\",mode!=\"idle\",mode!=\"iowait\",mode!=\"steal\"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job=\"node\"}) by (cluster, instance, cpu)) by (cluster)"
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # azurerm_monitor_alert_prometheus_rule_group.recording-rules-nodes["blue"] will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "recording-rules-nodes" {
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "northeurope"
      + name                = "recording-rules-nodes"
      + resource_group_name = "prvaks-monitoring-rg"
      + rule_group_enabled  = true
      + scopes              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + rule {
          + enabled    = true
          + expression = "count without (cpu, mode) (node_cpu_seconds_total{job=\"node\",mode=\"idle\"})"
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = "1 - avg without (cpu) (sum without (mode) (rate(node_cpu_seconds_total{job=\"node\", mode=~\"idle|iowait|steal\"}[5m])))"
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "(node_load1{job=\"node\"}/  instance:node_num_cpu:sum{job=\"node\"})"
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = "1 - ((node_memory_MemAvailable_bytes{job=\"node\"} or (node_memory_Buffers_bytes{job=\"node\"} + node_memory_Cached_bytes{job=\"node\"} + node_memory_MemFree_bytes{job=\"node\"} + node_memory_Slab_bytes{job=\"node\"})) / node_memory_MemTotal_bytes{job=\"node\"})"
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = "rate(node_vmstat_pgmajfault{job=\"node\"}[5m])"
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "rate(node_disk_io_time_seconds_total{job=\"node\", device!=\"\"}[5m])"
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "rate(node_disk_io_time_weighted_seconds_total{job=\"node\", device!=\"\"}[5m])"
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "sum without (device) (rate(node_network_receive_bytes_total{job=\"node\", device!=\"lo\"}[5m]))"
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "sum without (device) (rate(node_network_transmit_bytes_total{job=\"node\", device!=\"lo\"}[5m]))"
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "sum without (device) (rate(node_network_receive_drop_total{job=\"node\", device!=\"lo\"}[5m]))"
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = "sum without (device) (rate(node_network_transmit_drop_total{job=\"node\", device!=\"lo\"}[5m]))"
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

  # azurerm_monitor_data_collection_rule_association.aks_amwdcra["blue"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "aks_amwdcra" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "MSProm-northeurope-prvaks"
      + target_resource_id      = (known after apply)
    }

  # azurerm_monitor_data_collection_rule_association.aks_cidcra["blue"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "aks_cidcra" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "MSCi-northeurope-prvaks"
      + target_resource_id      = (known after apply)
    }

  # module.aad_pod_identity_access_policy.azurerm_key_vault_access_policy.kv_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "kv_access_policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
    }

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = "prvaksacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "aztf-spoke-rg"
      + sku                           = "Premium"
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_private_endpoint.acr-endpoint will be created
  + resource "azurerm_private_endpoint" "acr-endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "prvaksacr-to_aks"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "aztf-spoke-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "acr-endpoint-zone"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prvaksacr-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.acr_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"
      + tags                                                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + soa_record (known after apply)
    }

  # module.acr_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "spoke_to_acrs"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + tags                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.aks["blue"].azurerm_kubernetes_cluster.akscluster will be created
  + resource "azurerm_kubernetes_cluster" "akscluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "prvaks-blue"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = true
      + image_cleaner_interval_hours        = 168
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.29"
      + location                            = "northeurope"
      + name                                = "prvaks-blue"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "aztf-spoke-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = (known after apply)
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled        = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 3
          + max_pods                    = 30
          + min_count                   = 2
          + name                        = "defaultpool"
          + node_count                  = 2
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = 30
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "temppool"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_DS2_v2"
          + vnet_subnet_id              = (known after apply)
          + workload_runtime            = (known after apply)

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = false
          + secret_rotation_interval = "2m"
        }

      + kubelet_identity (known after apply)

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + maintenance_window_node_os {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip     = "192.168.100.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "userDefinedRouting"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "192.168.100.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + windows_profile (known after apply)

      + workload_autoscaler_profile {
          + keda_enabled                    = true
          + vertical_pod_autoscaler_enabled = false
        }
    }

  # module.aks-monitoring.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.aks-monitoring.azurerm_dashboard_grafana.aks_grafana will be created
  + resource "azurerm_dashboard_grafana" "aks_grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "northeurope"
      + name                                   = "prvaks-grafana"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "prvaks-monitoring-rg"
      + sku                                    = "Standard"
      + tags                                   = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aks-monitoring.azurerm_monitor_data_collection_endpoint.aks_dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "aks_dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "northeurope"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "prvaks-dce"
      + public_network_access_enabled = true
      + resource_group_name           = "prvaks-monitoring-rg"
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.aks-monitoring.azurerm_monitor_data_collection_rule.aks_cidcr will be created
  + resource "azurerm_monitor_data_collection_rule" "aks_cidcr" {
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "northeurope"
      + name                = "MSCI-northeurope-prvaks"
      + resource_group_name = "prvaks-monitoring-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + data_flow {
          + destinations = [
              + "log-analytics",
            ]
          + streams      = [
              + "Microsoft-ContainerInsights-Group-Default",
              + "Microsoft-Syslog",
            ]
        }

      + data_sources {
          + extension {
              + extension_json = jsonencode(
                    {
                      + dataCollectionSettings = {
                          + enableContainerLogV2   = true
                          + interval               = "1m"
                          + namespaceFilteringMode = "Include"
                          + namespaces             = [
                              + "kube-system",
                              + "default",
                            ]
                        }
                    }
                )
              + extension_name = "ContainerInsights"
              + name           = "ContainerInsightsExtension"
              + streams        = [
                  + "Microsoft-ContainerInsights-Group-Default",
                ]
            }
          + syslog {
              + facility_names = [
                  + "*",
                ]
              + log_levels     = [
                  + "Debug",
                  + "Info",
                  + "Notice",
                  + "Warning",
                  + "Error",
                  + "Critical",
                  + "Alert",
                  + "Emergency",
                ]
              + name           = "syslog-data-source"
              + streams        = [
                  + "Microsoft-Syslog",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "log-analytics"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # module.aks-monitoring.azurerm_monitor_data_collection_rule.aks_promdcr will be created
  + resource "azurerm_monitor_data_collection_rule" "aks_promdcr" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "northeurope"
      + name                        = "MSProm-northeurope-prvaks"
      + resource_group_name         = "prvaks-monitoring-rg"
      + tags                        = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + data_flow {
          + destinations = [
              + "prvaks-amw",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "prvaks-amw"
            }
        }
    }

  # module.aks-monitoring.azurerm_monitor_workspace.aks_amw will be created
  + resource "azurerm_monitor_workspace" "aks_amw" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "prvaks-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "prvaks-monitoring-rg"
      + tags                                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.aks-monitoring.azurerm_resource_group.monitoring_rg will be created
  + resource "azurerm_resource_group" "monitoring_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "prvaks-monitoring-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_data_reader will be created
  + resource "azurerm_role_assignment" "role_monitoring_data_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_reader will be created
  + resource "azurerm_role_assignment" "role_monitoring_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.northeurope.azmk8s.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"
      + tags                                                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + soa_record (known after apply)
    }

  # module.aks_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hub_to_aks"
      + private_dns_zone_name = "privatelink.northeurope.azmk8s.io"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + tags                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_network_id    = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet"
    }

  # module.aks_eid_groups.azuread_group.aksadmins will be created
  + resource "azuread_group" "aksadmins" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "AKS Admins Team"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.aks_eid_groups.azuread_group.aksusers will be created
  + resource "azuread_group" "aksusers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "AKS Devs Team"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.appgw["blue"].azurerm_application_gateway.agw will be created
  + resource "azurerm_application_gateway" "agw" {
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "blue-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "aztf-spoke-rg"
      + tags                        = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "aztf-spoke-vnet-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "aztf-spoke-vnet-be-htst"
          + path                                = "/path1/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "aztf-spoke-vnet-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "aztf-spoke-vnet-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "app-gateway-ip-configuration"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "aztf-spoke-vnet-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "aztf-spoke-vnet-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "aztf-spoke-vnet-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "aztf-spoke-vnet-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "aztf-spoke-vnet-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "aztf-spoke-vnet-httplstn"
          + id                          = (known after apply)
          + name                        = "aztf-spoke-vnet-rqrt"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 2
          + name     = "WAF_v2"
          + tier     = "WAF_v2"
        }

      + ssl_policy (known after apply)

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # module.appgw_nsg.azurerm_network_security_group.appgw-nsg will be created
  + resource "azurerm_network_security_group" "appgw-nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-spoke-vnet-appgw-nsg"
      + resource_group_name = "aztf-spoke-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.appgw_nsg.azurerm_network_security_rule.DenyAllInBound will be created
  + resource "azurerm_network_security_rule" "DenyAllInBound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInBound"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 1000
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_network_security_rule.controlplane will be created
  + resource "azurerm_network_security_rule" "controlplane" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "65200-65535"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowControlPlane"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_network_security_rule.healthprobes will be created
  + resource "azurerm_network_security_rule" "healthprobes" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHealthProbes"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 120
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_network_security_rule.inboundhttps will be created
  + resource "azurerm_network_security_rule" "inboundhttps" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow443InBound"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "Internet"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_subnet_network_security_group_association.appgwassoc will be created
  + resource "azurerm_subnet_network_security_group_association" "appgwassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.eid_role_assignment-aks_admins["blue"].azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-aks_rbac_admin["blue"].azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8bd22a44-7497-4eda-b790-c9d2b4e84d4d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-aks_users["blue"].azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-grafana_admin.azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-grafana_viewer.azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kv.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.kv.azurerm_key_vault.key-vault will be created
  + resource "azurerm_key_vault" "key-vault" {
      + access_policy                 = (known after apply)
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "prvakskv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "aztf-spoke-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tenant_id                     = (known after apply)
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.kv.azurerm_private_endpoint.kv-endpoint will be created
  + resource "azurerm_private_endpoint" "kv-endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "prvakskv-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "aztf-spoke-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "kv-endpoint-zone"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prvakskv-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.kv_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"
      + tags                                                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + soa_record (known after apply)
    }

  # module.kv_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "spoke_to_kvs"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + tags                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.laws.azurerm_log_analytics_workspace.laws will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "northeurope"
      + name                            = "prvaks-laws"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "aztf-spoke-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # module.peering.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "aztf-hub-vnet-to-aztf-spoke-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "aztf-hub-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "aztf-hub-vnet"
    }

  # module.peering.azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "aztf-spoke-vnet-to-aztf-hub-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet"
      + resource_group_name                    = "aztf-spoke-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "aztf-spoke-vnet"
    }

  # module.pip["blue"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "blue-appgw-pip"
      + resource_group_name     = "aztf-spoke-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.role_assignment_agic_appgw["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-acr["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-dnszone["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-rt["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-vnet["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks_identity_operator["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks_vm_contributor["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.spoke_networking.azurerm_network_security_group.nsgs["akssubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "akssubnet-nsg"
      + resource_group_name = "aztf-spoke-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_resource_group.spoke_rg will be created
  + resource "azurerm_resource_group" "spoke_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aztf-spoke-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_route_table.route_tables["akssubnet"] will be created
  + resource "azurerm_route_table" "route_tables" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "aztf-spoke-rt"
      + resource_group_name           = "aztf-spoke-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "route_to_firewall"
              + next_hop_in_ip_address = "10.0.1.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_subnet.spoke_subnets["akssubnet"] will be created
  + resource "azurerm_subnet" "spoke_subnets" {
      + address_prefixes                              = [
          + "10.1.16.0/20",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "akssubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-spoke-rg"
      + virtual_network_name                          = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_subnet.spoke_subnets["appgwsubnet"] will be created
  + resource "azurerm_subnet" "spoke_subnets" {
      + address_prefixes                              = [
          + "10.1.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "appgwsubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-spoke-rg"
      + virtual_network_name                          = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_subnet_network_security_group_association.nsg_associations["akssubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke_networking.azurerm_subnet_route_table_association.rt_associations["akssubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke_networking.azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-spoke-vnet"
      + resource_group_name = "aztf-spoke-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.uami_aks_cp["blue"].azurerm_user_assigned_identity.uami will be created
  + resource "azurerm_user_assigned_identity" "uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "prvaksblue-mi-cp"
      + principal_id        = (known after apply)
      + resource_group_name = "aztf-spoke-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tenant_id           = (known after apply)
    }

  # module.uami_aks_pod.azurerm_user_assigned_identity.uami will be created
  + resource "azurerm_user_assigned_identity" "uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "pod-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "aztf-spoke-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tenant_id           = (known after apply)
    }

Plan: 59 to add, 0 to change, 0 to destroy.
```
</details>